###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID ece.nitdgp.ac.in)
#  Generated on:      Thu Mar 26 19:49:47 2026
#  Design:            dvfs_tunable_multiplier
###############################################################
current_design dvfs_tunable_multiplier
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk_in}]  -name clk -period 5.000000 -waveform {0.000000 2.500000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk_in}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {b[4]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {precision[1]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {start}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {b[2]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {b[0]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {a[7]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {a[5]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {a[3]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {a[1]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {dvfs_v_state[1]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {b[7]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {b[5]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {precision[2]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {b[3]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {precision[0]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {b[1]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {a[6]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {a[4]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {a[2]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {a[0]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {dvfs_v_state[0]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {b[6]}]
set_input_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {precision[3]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[8]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[6]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[4]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[14]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[2]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[12]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[0]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[10]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[9]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[7]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[5]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[15]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[3]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[13]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[1]}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {done}]
set_output_delay -add_delay 0.001 -clock [get_clocks {clk}] [get_ports {result[11]}]
set_clock_latency -source -early -min -rise  -0.00599722 [get_ports {clk_in}] -clock clk 
set_clock_latency -source -early -min -fall  -0.00591969 [get_ports {clk_in}] -clock clk 
set_clock_latency -source -early -max -rise  -0.00599722 [get_ports {clk_in}] -clock clk 
set_clock_latency -source -early -max -fall  -0.00591969 [get_ports {clk_in}] -clock clk 
set_clock_latency -source -late -min -rise  -0.00599722 [get_ports {clk_in}] -clock clk 
set_clock_latency -source -late -min -fall  -0.00591969 [get_ports {clk_in}] -clock clk 
set_clock_latency -source -late -max -rise  -0.00599722 [get_ports {clk_in}] -clock clk 
set_clock_latency -source -late -max -fall  -0.00591969 [get_ports {clk_in}] -clock clk 
